output/posts/2017-09-20-programmatically-extract-information-from-a-org-journal-entry.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Programmatically extract information from a org-journal entry | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-09-20-programmatically-extract-information-from-a-org-journal-entry.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-09-19-installing-emacs-25.x-on-ubuntu.html" title="Installing Emacs 25.x on Ubuntu" type="text/html">
<link rel="next" href="2017-10-24-exporting-org-journal-entries-for-use-with-nikola.html" title="Exporting org-journal entries for use with Nikola" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="Programmatically extract information from a org-journal entry">
<meta property="og:url" content="https://example.com/posts/2017-09-20-programmatically-extract-information-from-a-org-journal-entry.html">
<meta property="og:description" content="Programmatically extract information from a org-journal entry


In an earlier journal entry I mentioned that I wanted to export the entries to
HTML and use that HTML directly in my blog. However I fou">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-09-20T17:09:00+02:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-09-20-programmatically-extract-information-from-a-org-journal-entry.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Programmatically extract information from a org-journal entry</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-09-20T17:09:00+02:00" itemprop="datePublished" title="2017-09-20 17:09">2017-09-20 17:09</time></a></p>
            
        <p class="sourceline"><a href="2017-09-20-programmatically-extract-information-from-a-org-journal-entry.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Programmatically extract information from a org-journal entry</h2>
<div class="outline-text-2" id="text-1">
<p>
In an earlier journal entry I mentioned that I wanted to export the entries to
HTML and use that HTML directly in my <i>blog</i>. However I found the functionality to
export the entries to a site, which is called "publishing", too limited for my
use case. For example, the export does not seem to support the creation of a
"tag cloud" for the tags of each entry.
</p>

<p>
sitemap and an index.
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">my-extract</span><span class="p">()</span>
  <span class="s">"Return time, clocked on current item in total."</span>
  <span class="p">(</span><span class="nf">save-excursion</span>
    <span class="p">(</span><span class="nf">save-restriction</span>
      <span class="p">(</span><span class="nf">org-narrow-to-subtree</span><span class="p">)</span>
      <span class="p">(</span><span class="k">let </span><span class="p">((</span><span class="nf">tstart</span> <span class="s">"2017-08-09"</span><span class="p">)</span> <span class="p">(</span><span class="nf">tend</span> <span class="s">"2017-08-10"</span><span class="p">))</span>
	<span class="p">(</span><span class="nf">org-clock-sum</span>
	 <span class="p">(</span><span class="nf">org-time-string-to-seconds</span> <span class="nv">tstart</span><span class="p">)</span>
	 <span class="p">(</span><span class="nf">org-time-string-to-seconds</span> <span class="nv">tend</span><span class="p">))))))</span>

<span class="p">(</span><span class="nf">org-map-entries</span> <span class="ss">'my-extract</span> <span class="nv">nil</span> <span class="nv">nil</span><span class="p">)</span>
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="2017-09-19-installing-emacs-25.x-on-ubuntu.html" rel="prev" title="Installing Emacs 25.x on Ubuntu">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-10-24-exporting-org-journal-entries-for-use-with-nikola.html" rel="next" title="Exporting org-journal entries for use with Nikola">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
